let picture = [
    "music_random_selector/images/Classical.jpg",
    "music_random_selector/images/Country.png",
    "music_random_selector/images/Electronic_Music.jpg",
    "music_random_selector/images/Hip-hop.jpg",
    "music_random_selector/images/Indie_Rock .jpg",
    "music_random_selector/images/R&B.jpg",
    "music_random_selector/images/Rock.jpg",
    "music_random_selector/images/Jazz.jpg",
    "music_random_selector/images/Pop.jpg"
];

let text = [
    "古典音樂是指根植於西方音樂傳統（包括宗教音樂和世俗音樂）的藝術音樂，包含了從大約11世紀直至當代的廣大時間範圍。這一藝術傳統的中堅時期通常被劃定為從1550年到1900年的這段時間，又稱共曉時期。西方音樂記譜法除了為演奏者預設了一段音樂的音高、速度、拍子、節奏，其特別之處在於對細節的處理也進行了描述，例如裝飾音與力度變化，然而這些裝飾音通常是為了尚未精通即興演奏藝術的初學者而寫的，另一方面，力度變化在很多情況下沒有標示，需要仰賴演奏者對音樂的內在了解去做詮釋。與其他樂種一樣，古典音樂在器樂方面有相當高度的發展，這與以歌曲為主的流行音樂形頗為不同。「古典音樂（classical music）」一詞最早見於19世紀初期，最初是用於凸顯從巴哈到貝多芬的這一段黃金時期。牛津英語詞典中「古典音樂（classical music）」一詞最早出現在1836年。",
    "鄉村流行樂 (英語：Country pop)源自鄉村音樂和流行樂的一個子類別，雖然起初被歸類在鄉村音樂裡，但因為在1950年代後期開始類似鄉村音樂努力的延續，最初稱為納什維爾之聲。到了1970年代中期，許多鄉村音樂歌手正從鄉村流行的聲音過渡，努力導向一些唱片進入《告示牌雜誌》主流排行的前40名，以及在鄉村音樂排行榜高居榜首的成功後，現在的鄉村流行樂比較像是成人抒情音樂。近年來，有很多流行音樂歌手把事業跨至鄉村音樂。至2003年，Sheryl Crow, Michelle Branch（The Wreckers）, Los Lonely Boys, MercyMe和Kid Rock都有歌曲在熱門鄉村單曲及歌曲榜上。Jimmy Buffett, 艾爾頓·約翰, Uncle Kracker, John Mellencamp，和Bret Michaels各自都有與鄉村音樂歌手合唱，那些歌手也被列入為鄉村流行樂。",
    "電子音樂，亦簡稱電音，是使用電子樂器以及電子音樂技術來製作的音樂；而創作或表演這類音樂的音樂家則稱為電子音樂家。一般而言，使用電子機械技術與使用電子技術製作的聲音是可以區別的。使用電子機械製造聲音的設備有電傳簧風琴、漢門式電風琴與電吉他；而純粹的電子聲音製造設備則有特雷門、聲音合成器與電腦。電子音樂一度幾乎完全與西方，特別是歐洲的藝術音樂連結，但自從1960年代晚期以後，因爲摩爾定律造就了可負擔的起的音樂科技，意味著使用電子方式製作音樂變的越來越在各國不同區域流行的領域普及與發揚起來。今日的電子音樂包含各式各樣以及範圍從實驗藝術音樂到流行形式如電子舞曲。最近幾年，當電腦科技已經變得更容易接近並且音樂軟體已經進步，與音樂製作互動的科技現在已能實用化，因而得以支持與傳統音樂音樂表演型式不同的實踐方法：例如，膝上型電腦表演（laptronica）以及現場編碼。",
    "嘻哈音樂也譯說唱音樂（英語：Hip-hop Music，也叫做hip-hop或rap music），是一種跟著伴奏、帶著韻律吟誦即饒舌／說唱的音樂風格。所用的伴奏多產生於音樂取樣的方式，亦被稱作「嘻哈音樂」，兩者均誕生於廣義的嘻哈文化。該文化包含了司眾饒舌、控盤（刮碟）、歇段舞（霹靂舞）和塗鴉等幾種街頭藝術。 1990年代的嘻哈音樂開始和美國各地的音樂風格融合，例如南部嘻哈及亞特蘭大嘻哈，同時嘻哈音樂也和其他的流行音樂風格同化，例如新靈魂樂。嘻哈音樂是1990年代中間最暢銷的音樂風格之一，流行風潮到21世紀仍延續著。嘻哈音樂也持續在主流音樂發揮影響力。在美國也看到一些相關類型音樂的成功，例如強調節奏及音樂多於歌詞內容的曠課樂。2010年代，許多歌手像是德雷克、妮姬·米娜、 傑寇以及肯德里克·拉馬爾皆取得巨大的商業成功。此時陷阱音樂團體或歌手，如Migos及未來小子也受到歡迎。",
    "獨立音樂（英語：Independent music），或稱硬地音樂（Indie music / Indie），是指有別於主流商業唱片廠牌所製作的音樂。顧名思義，獨立音樂的製作過程獨立自主，從錄音到出版都由音樂家獨力完成。獨立一詞可用以形容其他音樂類型，如獨立搖滾。雖然許多獨立音樂家的風格無法清楚界定，因而歸類到不同的音樂類型，但在一般說法上或音樂評論中依舊視為一種音樂類型，包括那些非獨立製作的音樂。有賴於網路科技，音樂家能夠以低廉的成本吸引龐大的潛在聽眾，而不一定要依附在主流廠牌下。新的數位音樂軟體也鼓勵了使用者發掘新的音樂類型。數位服務的版稅可能成為主要收入的來源。若獨立音樂家已投入成本錄音、生產以至於推廣專輯，發布到網路上的成本很小，甚至免費。數位服務讓新的歌迷接觸到獨立音樂，也讓網路音樂零售商增加銷量。若能在網路上供應，音樂家們也可以更頻更快推出作品。",
    "節奏藍調（英語：rhythm and blues，簡稱：R&B或RnB），是一種美國非裔藝術家首先採用，並融合了爵士樂、福音音樂和藍調音樂的音樂形式。這個音樂術語是由美國告示牌（Billboard）於1940年代末所提出。節奏藍調最初在1947年的美國被告示牌雜誌的Jerry Wexler創造為一個音樂的市場行銷術語[1]，取代了種族音樂（英語：Race Music，又譯黑人音樂；最初來源於黑人社群，但是被戰後的社會認為是會令人很不愉快的詞語）而告示牌在1949年將其分類為哈林暢銷排行榜。這個詞最初被用於定義包含了12小節藍調格式和一種帶有節拍背景的電藍調融合爵士樂的搖滾樂，後來這種音樂轉變成了一種搖滾樂的基本元素。在1960年代，節奏藍調被用於總括靈魂樂和放克音樂的術語。而現在R&B的縮寫差不多一直被用於代替全寫「節奏藍調」，而主流則用它來表示由迪斯可逐步變得不那麼流行而發展出來的Contemporary R&B──一種現代靈魂樂和受放克音樂影響的流行音樂。",
    "搖滾音樂（英語：Rock Music）是20世紀50年代初起源於「搖滾」（英語：Rock and roll） 音樂中的一種廣泛音樂類型，並在20世紀60年代後期，特別是在英國和美國發展成為一系列不同的風格。它起源於20世紀40年代和50年代的搖滾，音樂格調吸收了非洲裔美國人的藍調和節奏藍調以及鄉村音樂的音樂風格。搖滾音樂也吸收了一些其他的音樂流派，如電藍調和民間音樂，並吸收了爵士樂和古典音樂的影響和其他音樂風格。在音樂上搖滾已經集中聚焦在電吉他，與電貝斯和鼓組及一個或多個歌手的組合，融合了流行樂和搖滾樂的組成。一般情況下，搖滾樂是以歌曲為主的音樂，通常以4/4拍節奏使用詩歌合唱形式，但音樂流派變得異常多樣化。就像流行樂一樣，歌詞往往強調浪漫的愛情，但也涉及其他各種型態，經常是社交或政治的主題。",
    "爵士樂（英語：Jazz）是一種音樂流派，它於19世紀末期至20世紀初期起源於美國紐奧良的非裔美國人的社區，植根於藍調和拉格泰姆音樂以及歐洲的軍樂，並且由其發展而來。自1920年代的爵士時代以來，爵士已經被認為是音樂表達的一種主流形式。其後，爵士樂亦以若干相對獨立的、傳統的流行音樂風格的形式表現出來，這些相對獨立的風格間亦有關聯，其間的紐帶即是非裔美國人的音樂與歐裔美國人音樂之間的互相融合。爵士樂在其發展過程中除了有美國黑人音樂的根源以外，還吸收了來自於不同文化的不同音樂風格，逐漸形成了今天多門多類的爵士樂，所傳遞的內容也更為多樣，已經不僅限於早期的「黑人風格」。世界各地的知識份子公認爵士樂為「起源於美國的藝術形式之一」。",
    "流行音樂（英語：Popular Music），亦稱流行歌曲、現代流行音樂，是指一段時期內廣泛被大眾所接受和喜歡的音樂。現代流行音樂又可作商業化運作，有時稱作商業音樂。和流行音樂形成對比的音樂形式是古典音樂和民間音樂。目前因為利益壟斷的關係，導致於外界難以一窺堂奧。而流行樂（英語：Pop Music），流行音樂的一個分支音樂類型。「Pop」一開始是「流行音樂」（Popular Music）的縮寫，也是其同義詞，不過大約在1954年以後逐漸被用來指稱狹義的特定音樂類型。流行樂歌曲特指歌詞內容主要以現代潮流為主，例如敘述愛情或生活等，樂器用現代流行的樂器為主。流行樂也有分支，例如電子流行、合成器流行、流行舞曲...等。"
];