let questions = [
    {
        "question":"以下三首歌哪一首不是三大安魂曲？",
        "answers":[
            ["莫札特的《Ｄ小調安魂曲》",1],
            ["威爾第的《安魂曲》",2],
            ["佛瑞的《安魂曲》",3],
            ["貝多芬《安魂曲》",4]
        ]
    },
    {
        "question":"中國的傳統樂器有幾個種類？",
        "answers":[
            ["6種",1],
            ["7種",2],
            ["8種",3],
            ["9種",4],
        ]
    },
    {
        "question":"西方樂器分為四大類，請問不包含以下哪一類？",
        "answers":[
            ["木管",1],
            ["鍵盤",2],
            ["銅管",3],
            ["敲擊",4]
        ]
    },
    {
        "question":"以下哪一首協奏曲不屬於五大綱琴協奏曲？",
        "answers":[
            ["德沃夏克的《新世界交響曲》",1],
            ["貝多芬的《第五號降Ｅ大調鋼琴協奏曲「皇帝」》",2],
            ["柴可夫斯基的《第一號降Ｂ大調鋼琴協奏曲》",3],
            ["舒曼的《Ａ小調鋼琴協奏曲》",4]
        ]
    },
    {
        "question":"以下哪一首個不屬於六大交響曲？",
        "answers":[
            ["貝多芬的《第六田園交響曲》",1],
            ["柏遼茲的《幻想交響曲》",2],
            ["拉赫曼尼諾夫的《第二號Ｃ小調鋼琴協奏曲》",3],
            ["柴可夫斯基的《悲愴交響曲》",4]
        ]
    },
    {
        "question":"以下哪一位不是音樂史上的3B？",
        "answers":[
            ["布拉姆斯（Brahms, Johannes）",1],
            ["巴赫（Bach, Johann Sebastian）",2],
            ["貝多芬（Beethoven, Ludwig van）",3],
            ["巴爾托克（Bartok, Bela）",4]
        ]
    },
    {
        "question":"以下誰是「交響曲之父」？",
        "answers":[
            ["海頓（Haydn, Franz Joseph）",1],
            ["貝多芬（Beethoven, Ludwig van）",2],
            ["莫札特(Mozart, Wolfgang Amadeus)",3],
            ["巴赫（Bach, Johann Sebastian）",4]
        ]
    },
    {
        "question":"以下誰是「協奏曲之父」？",
        "answers":[
            ["布拉姆斯（Brahms, Johannes）",1],
            ["莫札特(Mozart, Wolfgang Amadeus)",2],
            ["巴爾托克（Bartok, Bela）",3],
            ["韋瓦第（Vivaldi, Antonio Lucio )",4]
        ]
    },
    {
        "question":"以下誰是「音樂之父」？",
        "answers":[
            ["柴可夫斯基(Tchaikovsky, Pyotr Ilyich)",1],
            ["巴赫（Bach, Johann Sebastian）",2],
            ["貝多芬（Beethoven, Ludwig van）",3],
            ["海頓（Haydn, Franz Joseph）",4]
        ]
    },
    {
        "question":"以下誰是音樂史上的「樂聖」?",
        "answers":[
            ["貝多芬（Beethoven, Ludwig van）",1],
            ["巴赫（Bach, Johann Sebastian）",2],
            ["柴可夫斯基(Tchaikovsky, Pyotr Ilyich)",3],
            ["莫札特(Mozart, Wolfgang Amadeus)",4]
        ]
    }
    
];

let countTotal =[4,3,2,1,3,4,1,4,2,1];

let finalAnswers={
        "A":["愛情有點酸","在今年，你的愛情有一些酸哦，不過還好，不苦，而且有時候雖然酸，酸中也帶了絲甜。即使你會與喜歡的人沒有緣分走到一起，但是你們彼此能祝福對方。心中有些酸，是因為你看得開。現在對愛情真的看得淡了，不會強求，也不渴望什麼轟轟烈烈，甜甜蜜蜜，只希望過了這陣酸，會有甜頭來。"],
        "B":["愛情超級甜","在今年裡，你的愛情超級甜蜜哦，真的有如蜜糖一樣甜，不時撒一把狗糧，能讓旁邊的人都覺得發膩哦。當然啦，你這麼幸運，遇到甜蜜的愛情，也是因為你是一個溫暖的人啊，值得這麼好的愛情，也值得別人好好疼愛你。你也會加倍珍惜，好好回饋對方，這樣才是愛情的正確打開方式。"],
        "C":["愛情有苦有甜","你在今年的愛情，一定是有苦也有甜的，其實這才是正常的感情，或者說普通的感情。有的人一直甜蜜，他們是幸運兒。而你是普通人，感情中會有甜蜜的時候，也會有爭吵矛盾，會有淚水，會有痛苦。但是學會理智經營感情，在甜的時候好好享受，在苦的時候及時審視，愛情才能持久。"],
        "D":["愛情平淡沒滋味","今年裡，你的愛情沒有啥滋味，可能你根本就遇不到愛情，繼續又單身一整年，這樣也好，你可以忙於賺錢。也可能你的愛情就是有如一碗平平淡淡的白開水，沒有什麼滋味，但是沒有它又不行。或者是缺少了一些刺激，但是誰的愛情能一直轟轟烈烈呢？平淡如水，細水長流，未嘗不是一件好事。"]
};